5
11
12
13
14
15
16
17
18
19
20
21
29
30
40
50
60
70
80
90
101
110
200
900
1000
1001
1000000
1100000
ʾ
˅
.
/
?
\
^
_eyes_
~
1_tháng
2_tháng
3_tháng
4_tháng
5_th
5_tháng
a
â
ă
a_clare
about_
access_nb
act
actor
add
address
adult
advice
afternoon
again
again_again
again2
agree
aim
alarm
alien
all
all_day
all_of_us
all_over_norfolk
all_over_uk
all_over_uk
always
ấm
ẵm
ầm_ầm
ấm_đun_nước
ấm_trà
ẩm_ướt
ăn
ăn_cơm
an_ninh
ăn_ở
an_toàn
an_toàn
and
angry
anh
anh_cả
anh_em_họ_hàng
anh_em_ruột
anh_hai
anh_hùng
anh_hùng_dân_tộc
ánh_nắng
anh_rể
ánh_sáng
animal
animation
any
anything
ao
áo
áo_ba_lỗ
áo_comple
áo_dài
áo_dài_tay
áo_đầm
áo_gió
áo_lạnh
áo_len
áo_ngắn_tay
áo_phông
áo_sơ_mi
áo_thun
áo_veston
apple
appointment
april
area
arm
around
arrow
ask
ask_question
asleep
associate_with
association
at_last_
attend
attitude
available
avatar
awareness
b
bà
ba_là
ba_lô
bà_ngoại
bà_nội
bác
bắc
bạc
bác_gái
bác_hồ
bạc_màu
bác_sĩ
bác_sĩ
bác_trai
back
bad
bag
bãi_biển
bài_thi
ball
ball_big
ball_bouncing
ball_round
ball_soft
ball_throw
balloon
bàn
bẩn
bạn
bạn_bè
bắn_bi
bàn_chải_đánh_răng
bàn_chân
ban_hành
bàn_tay
bạn_thân
bàn_thờ
bán_vé
banana
banana_with_peel
bảng
bánh
bão
bao_nhiêu
bao_nhiêu_tiền
bảo_quản
bao_xa
bập_bênh
bat
bật
bất_cứ_điều_gì
bắt_đầu
bầu_trời
bay
bây_giờ
bê
bế
bể_cá
bế_giảng
bế_mạc
bề_mặt_cong
bear
bear_furry
bear_nb
bear_with_it_
become
bed
been
been_go
been_go
been_go
been_in
been_to
before
behaviour
belong
belong_down
bên_phải
bến_tàu
bên_trái
bến_xe
benefit
benefits
bệnh
bệnh_nhân
bệnh_nhân
bệnh_viện
bệnh_viện
béo
bếp
bếp_ga
best
better
bí_đỏ
bị_động
bí_xanh
biển
biển_báo_nguy_hiểm
biển_cấm
biết
biết_ơn
biếu
biểu_tượng
big
big_capital
big_eat
big_eyes
big_eyes
bike
bird
biscuit
bite
black
block
blue
bò
bố
bộ_binh
bó_bột
bộ_công_an
bộ_đội
bổ_nhiệm
bổ_sung
bộ_tài_chính
bộ_trưởng
bơi_lội
bờm_tóc
bồng
book
books
boring
bớt
boy
boy_big
boy_little
brain
brave
break-in
bridge
bright
brighton
bring
bring_here
brother
brown
brush
bữa_ăn
bức_tranh
bucket
bug
buggy
bụi
building
bún
bùn
bụng
buổi_chiều
buổi_sáng
buổi_tối
buổi_trưa
buồm_căng
buồn
buông_vó
but
bưu_điện
buy
c
c_ex
cá
cá_bống
cá_chim
cà_chua
cá_diếc
cá_đối
cá_dưa
cá_heo
cá_hồng
cá_mồi
cá_mực
cá_ngừ
ca_nô
cá_nục
cà_phê
cá_rô
cà_rốt
cá_sấu
ca_sĩ
cá_song
cá_thu
cá_trạch
cá_trích
cá_vàng
cá_voi
các_bạn
các_bạn
cafe
cái_bát
cái_càng
cái_chảo
cái_chén
cái_cốc
cái_gì_
cái_hót_rác
cái_kính
cãi_nhau
cái_nồi
cái_thìa
cái_trống
cái_vòng
cam
cấm
cảm_cúm
cảm_giác
cảm_giác_
cam_kết
cảm_ơn
cấm_trại
camel
camera
campaign
cần
can_
cán_bộ
cằn_cỗi
can_đảm
can_ex
cancel
canh
cánh_diều
cảnh_sát
cannot
cant_
cao
cao_đẳng
cao_học
cấp_cứu
cặp_sách
cặp_tóc
captain
capture
car
car_fast
careful
carry_ball
carry_drink
carry_spoon
carry_wand
castle
castle_large
castle_round
cat
cát
cất_quần_áo
câu_lạc_bộ
cầu_thang
cầu_trượt
cầu_vồng
cầu_vượt
cay
cây_kéo
cây_xanh
centre
chải_tóc
chậm
chăm_chỉ
chân
chăn
change
change_back
change_mind
changes
chào_bạn_bè
chào_cờ
chào_đón
chào_mừng
chào_người_lớn
chập_chững
character
chase
chất_béo
chất_bổ
chất_bột_đường
chất_đạm
chất_lượng
chất_thải
cháu
châu_mỹ
cháu_ngoại
cháu_nội
chạy
chảy_máu
chè
check
cheo_leo
chết
chị
chị_dâu
chi_tiết
chiếc_chiếu
chiến_dịch
chiến_lược
chiêng
chiếu_phim
child
child_ex
children_
children_goes_to
chim_bồ_câu
chim_chích_chòe
chim_cú
chim_cút
chim_diều_hâu
chim_quạ
chim_rừng
chim_sâu
chim_sẻ
chim_sơn_ca
chính_mình
chính_sách
chính_tả
chips
chips_eating
cho
chờ
chợ
chó_sủa
chocolate
chổi
chói_chang
chơi_game
chọn
chông
chồng
chống_hạn
choose
chop
chớp
christmas
chú
chủ_nhật
chú_rẻ
chủ_tịch
chú_ý
chua
chưa
chữa_bài
chữa_bệnh
chúc_mừng
chức_năng
chúng_nó
chúng_tôi
chương_trình
chuyên_cần
chuyển_đổi
chuyên_gia
city
clap
clear
click
clock
clog
clown
có
cô
cố
cổ
cơ_bắp
cô_dâu
có_được
cố_gắng
co_giãn
cô_giáo
co_lại
có_thể
cởi
coin
cold
colour
cơm
come
come_on
come_over
come_to_you
communication
compa
company
computer
computer_game_old
con
còn
con_bê
con_bò
con_bướm
con_chim
con_chó
con_chuột
con_cọp
con_cua
con_dê
con_đẻ
con_đường
con_ếch
con_gà
con_gấu
con_hổ
con_hươu
con_khỉ
con_lừa
con_lươn
con_mèo
con_nai
con_ngựa
con_nuôi
con_ốc
con_rắn
con_rùa
con_sóc
con_sư_tử
con_thỏ
con_trâu
côn_trùng
con_vịt
con_voi
công_an
công_cụ
công_dụng
công_nhân
công_tác
cổng_trường
công_việc
công_viên
congratulations
contact
contact_me
contactpoint_hand
corner
cost
cột_cờ
council
cow
crab
crash
create
crown
cry
cũ
củ
củ_mài
cửa
của_các_bạn
của_chúng_tôi
của_nó
cửa_ra_vào
cửa_sổ
của_tôi
cục_pin
cục_tẩy
cụm_dân_phố
cưng
cung_cấp
cung_cấp
cứng_đầu
cùng_nhau
cuộc_hẹn
cười
cuối_cùng
cupboard
cupboards
cứu_nước
c-x
c-x2
d
đ
d_gd
đá
đá_cầu
dạ_dày
đắc
dad
đại_biểu
đài_catset
đại_diện
đại_học
đại_học
đại_lộ
đại_sứ_quán
đài_truyền_hình_việt_nam
đầm_ấm
đám_cưới
đàn_bầu
dân_cày
đàn_ghi_ta
đàn_măng_đô_lin
đàn_óc_gan
dân_tộc
dân_tộc
dân_tộc_khơ_me
dân_tộc_kinh
dân_tộc_mường
dân_tộc_nùng
dân_tộc_tày
dân_tộc_thái
đàn_tranh
đàn_vi_ô_lông
đăng
đảng
dành_cho
danh_dự
đánh_giá
đánh_răng
danh_sách
đánh_trống
đạo_đức
đất
date
đau
đầu
đậu
dầu_ăn
đầu_đĩa
đầu_gối
dấu_hiệu
đầu_tư
dây_buộc_tóc
dây_chuyền
dạy_dỗ
đề_nghị
deaf
deer
delicious
đệm
đen
đèn
đến
đền
đèn_điện
đèn_đỏ
đến_nơi_đến_chốn
đèn_vàng
đèn_xanh
dép
đẹp
dép_quai_hậu
dept
design
designer
desk
detail
develop
dì
đi
di_chuyển
đi_qua
đĩa
địa_cầu
điếc
điểm_tiếp_xúc
điện
điện_thoại
diện_tích
điền_vào
diễn_viên
điều_hòa
điều_khiển
differences
differences_nb
different
different_down
different_ex
different2
differentnew
difficult
đình
disagree
discuss
discuss_sit_+_meet_
đó
đỏ
đồ_chơi
do_not
do_not
do_not_have
do_not_have
do_not_know
do_not_like
do_not_like
đỏ_rực
đoàn_kết
đoàn_kết
đoàn_thuyền
đoàn_viên
đọc
độc_ác
độc_lập
độc_thân
dog
dog_small
dogwalk
đồi
đội_kèn
đội_sao_đỏ
dối_trá
đội_trống
đội_viên
dọn_dẹp
đơn_giản
đơn_thuôc
đóng
đông
đồng_bằng
đồng_cỏ
đồng_hồ
đồng_hồ_đeo_tay
đồng_hồ_treo_tường
động_tác
động_vật
đồng_ý
donkey
dont_like
door
down
dragon
dragon_big
dragon_sparkling
dress
drink
drink_hot
drink_throw
drinking
drop
drop_
dữ
đủ
dự_án
dự_báo
du_lịch
đu_quay
đũa
đùm_bọc
dùng
dừng
đứng
đúng_giờ
đứng_yên
được
được_phép
dưới
đường
đường_làng
đường_phố
đứt_tay
duyên_dáng
e
ê
e_clare
e_ex
earphones
ears_
earth
earth_round
easy
eat
educate
education
effective
eight
eight_hundred
eight_o_clock
eighteen
eke
electricity
elephant
eleven
eleven_o_clock
em
em_dâu
em_gái
em_rể
em_út
email
employ
employment
end
english
enjoy
enquiry
enter_me
enter_me
envelope_in
ép
equipment
escape
event
every_year
everyday
everything
example
exchange
expect
expensive
experience
explain
explain_me
f
f_ex
facial
family
famous
fangs
fashion
favourite
february
feedback
feel
feel_all_fingers
feelcorrect
fifteen
files
fill
fill_in
find
finger_point
finger_point
fingerspell
finish
finish2
fire
fire_breathing
first
fish
five
five_hundred
five_o_clock
fizzy
flip_pages
floor
flower
flury
fly
food
football
forever
forgive
form
form_point_down
found
four
four_hundred
four_o_clock
fourteen
free
friday
friend
friends
frog
from
front
frosty
frozen
full
funny
fur
future
g
g_ex
gà_công_nghiệp
gà_gáy
gà_mái
gà_trống
gặm_cỏ
game
gan
gần
gắn_bó
gan_dạ
găng_tay
gặp
gặp_gỡ
gấp_quần_áo
gầy
gãy_tay
get
get_up
ghế
ghé_sô_pha
ghế_sopha
ghen_tuông
ghét
gia_đình
giá_sách
giả_vở
giải_bày
giải_thích
giải_trí
giảm
giáo_dục
giáo_dục
giao_tiếp
giặt
giây
giầy
giày_nam
giày_nữ
giầy_thể_thao
gieo_mạ
gió
giỏ
giờ
giờ_ngoại_khóa
giờ_ra_chơi
giới_thiệu
giống_nhau
girl
giườmh
giường
giương_buồm
giúp_bạn
giúp_đỡ
giúp_tôi
give_form
give_me
glasses
glittering
go
gỗ
go_away
go_past
go_to_left
go_with_you
gối
gội_đầu
gọi_điện_thoại
going_to
gold
good
gọt_bút_chì
grandma
great
green
gửi
gửi_thư
h
hai_là
hải_quân
half_hour
half_past
hàn_đới
hand
hàng_dọc
hàng_ngang
hàng_rào
hành_khách
hạnh_kiểm
hành_tinh
hao_đào
hấp_thu
happen
happy
hard
hard_of_hearing
hare
hare_ears
hát
hate
hầu
have
have_a_look
have_a_look
have_a_look_
have_ex
have_to_ex
have_to_go_ex
hay
hãy_cho_tôi_biết
he
hearing
hearing_aid
hearing_aid
hearing_sound
hearing_sound
hello
help_-_me
help_you
hen
hẹp
here
hết
hiếm_khi
hiền
hiền_lành
hiểu
hiệu_quả
hiếu_thảo
hiệu_trưởng
hình_dáng
hình_dung
hình_thức
hire
hít_vào
hồ
họ_hàng
họ_ngoại
họ_nội
hoa_cúc
hoa_hải_đường
hoa_hồng
hoa_huệ
hoa_mai
hoa_móng_rồng
hoa_nhài
hoa_phong_lan
hoa_sen
hoa_sữa
hoa_thủy_tiên
hoặc
hoan_nghênh
hoang_tưởng
hoạt_động
hoạt_động
học
học_hỏi
học_lực
học_nhóm
học_sinh
học_thức
hog
hỏi
hội_đồng
hội_đua_thuyền
hội_trường
hold_on
hold_on
hold_on
hold_on
holding
hôm_nay
hôm_qua
home
hơn
hòn_sỏi
hòn_than
hồng
hood
hộp_bút
horrible
hot
hot_dog
hours
house
how_
how_are_you
how_long
how_long?
how_many
how_much
hư
húc
human
hunter
hướng_tây
hut
hút_máu
hữu_cơ
hủy_bỏ
huyện
i
i_clare
i_ex
ích_kỹ
idea
ideas
ill
imagination
imagine
impact
important
improve
in
inclusive
inform_us
information
inside
insurance
interesting
interesting2
internet
interpreter
ireland
issues
ix_down
ix_front
ix_front_left
ix_front_right
ix_left
ix_left_top_corner
j
jacko_
january
jape
jealous
jump
june
just_a_moment
k
kế_hoạch
keep
keep_in_touch
kem
kém
kênh
kẹo
kéo_co
keo_kiệt
kéo_vó
kết_nạp
kết_quả
kết_quả
kết_thúc
kết_thúc
key
key_locked
khác
khác_nhau
khách_du_lịch
khai_giảng
khám_bệnh
khăn
khấn_lễ
khăn_mặt
khẩu_trang
khèn
khi_nào_
khiêm_tốn
khinh_rẻ
khô
khó_chịu
khó_khăn
khoai_tây
khoảng
khóc
khỏe
không
không_có_gì
không_hiểu
không_kịp
không_thể
không_thích
khu_vực
khuya
kiểm_tra
kiến_thức
kính_trọng
kịp_giờ
kitchen
kite
know
know_well
knowledge
kỹ_thuật
l
lá_thư
lake
làm
làm_cỏ
làm_thủy_lợi
làng
lãng_phí
làng_xóm
language
lạnh
lãnh_đạo
lành_mạnh
lao_động
lặp_lại
large
late
later
lâu
lau_nhà
lava
lây_bệnh
learn_ex
left_and_right_stand_meet_object
left_finger_point_left
left_stand
left_to
lên
lên_bảng
lên_tầng
lên_xe
less
letter
lexicon
library
lịch
lịch_sử
lịch_sự
liên_hệ
liên_hoan
liên_kết
liên_quan
life
lift
like
link
lion
lion_big
lip_reading_me
lip_reading_me
lipspeaking
list
listening_me
little
live
lo
lọ_hoa
lơ_lửng
log
lợi_ích
london
lonely
lòng_đường
lòng_mẹ
look
look_after_me
look_at_map
look_ex
look_me
looking
lớp_bổ_túc_văn_hóa
lớp_học
lớp_phó
lớp_trưởng
lose
lost
love
lovely
low
lũ_lụt
luật_lệ
luật_lệ
lùn
lunchbox
lưng
lược
lười_biếng
luôn
lượn
luyện_kim
m
m_clare
m_clare_ex
má
mà_
mặc
magic
mãi_mãi
mái_nhà
make
make_sure
màn
mặn
măng
mạnh
mạnh_mẽ
map
mập
march
marriage
married
marytest
mat
mát
mắt
mát_lạnh
mặt_trận_tổ_quốc
mặt_trăng
mặt_trời
mặt_trời_lặn
mặt_trời_mọc
match
màu_đậm
màu_mỡ
màu_nhạt
màu_sắc
mâu_thuẫn
may
máy_bay
máy_vi_tính
maybe
me
mẹ
mean
means
meat
medical
medicine
meet
meet
meet_left_place
meeting
mênh_mông
mệt
mì_chính
mì_tôm
miền_bắc
miền_nam
miền_núi
miễn_phí
miền_trung
miệng
miếu
mình
minicom
mổ
mở
mợ
mở_cửa
mô_hình
mô_hình_phóng_to
mô_hình_thu_nhỏ
mồ_hôi
mobile
mobilehold
modern
mới
mỗi_năm
molly
môn_âm_nhạc
môn_đạo_đức
môn_học
môn_kỹ_thuật
môn_mỹ_thuật
môn_thể_dục
môn_thủ_công
môn_tiếng_việt
môn_toán
môn_tự_nhiên_xã_hội
monday
money
monkey
monster
moon
moon_round
more
một_là
một_lần_nữa
mother
mountain
mouse
mouse_small
mouse_small
move
mũ
mũ_lưỡi_trai
mưa
mùa_đông
mùa_hè
mưa_phùn
mưa_rào
mùa_thu
mua_vé
mùa_xuân
mục_tiêu
mug
mùi_thối
mùi_thơm
mum
muối
muối_u_rát
muốn
muộn
museum
music
must
my
n
n_n
n2
naive
nam
năm
nằm
năm_2015
nắm_chặt_tay_súng
năm_học
name
nắn_nót
nắng
năng_khiếu
năng_lực
não
national
nâu
nấu
nấu_ăn
naughty
này
near
need
neighbours
neilwave
nệm
network
new
next
next_year
ngả_đường
ngã_tư
ngâm_thơ
ngàn
ngăn_nắp
ngày
ngay_bây_giờ
ngày_mai
ngay_thơ
nghe
nghé
nghệ_thuật
nghèo
nghỉ_học
nghiêm_chỉnh
nghiêm_túc
ngoài
ngoại_lệ
ngoan
ngồi
ngôi_sao
ngón_chân
ngôn_ngữ
ngón_tay
ngọt
ngọt_lịm
ngọt_ngào
ngủ
ngủ_say
ngửi
người_bán_hàng
người_công_nhân
người_kia
người_lạ
người_lái_tàu_hỏa
người_lái_tàu_thủy
người_lái_xe
người_lớn
người_mẫu
người_nông_dân
người_quen
người_yêu
nguy_hiểm
nhà
nhà_ga
nhà_nước
nhà_sàn
nhà_trẻ
nhà_tù
nhà_vệ_sinh
nhà_xe
nhận
nhẵn_nhụi
nhân_viên
nhanh
nhạt
nhặt_rau
nhảy_dây
nhiệm_vụ
nhiều
nhiều_hơn
nhìn
nhỏ
nhớ
như_thế_nào
nhức_đầu
nhung_hươu
nhường_nhịn
ni_tơ
nice
nine
nine_hundred
nine_o_clock
nineteen
no
nợ
nở_ra
nói
nói_chuyện
nói_dối
nội_dung
nội_quy
noise
noises
nơm
nón_lá
none
nóng
nông_giang
nồng_nàn
nông_thôn
nộp_bài
norfolk
north
not_say
not_yet
notation
nothing
now
now_bounce
nttemp
nữ
nửa_
nửa_giờ
núi
number
nựng
nước
nước_hoa_quả
nước_mắm
nước_ngọt
nước_tương
o
ô
ơ
o_clare
o_clare
ở_đâu
ở_giữa
ô_tô
occassionaly
offer
office
old
olympic
ôm
on
ổn_định
ôn_tập
on_top_paper
one___
one_after_another
one_hundred
one_o_clock
one_to_one
ông
ống_dẫn
ông_ngoại
ông_nội
only
open_doors
or
or2
orange
organisations
our
out
outsmart
owl
oxi
p
p_
padlock_style_lock
palm_down
panic
panic_not_finish
panic_unfinished
paper
paranoid
park
parts
past
patient
pay
pay_me
pen
people
performance
performing_hands
person
person_me
person2
phà
phá_vỡ
phạt
phát_biểu
phát_biểu
phát_hiện
phát_tin
phát_triển
phát_triển
phim
phở
phó_hiệu_trưởng
pho_mát
phơi
phổi
phone_
phone_me
phone_pick_up
phone_you
phòng_âm_nhạc
phòng_bếp
phòng_họp
phòng_mỹ_thuật
phòng_ngủ
phòng_thí_nghiệm
phòng_thư_viện
phòng_vi_tính
phòng_y_tế
photograph
phrase
phrase2
phục_vụ
phường
phương_pháp
phương_tiện_giao_thông
phút
pick
pick_lot
pick_lot_gd
pick_right_side
pick_up_ball
pick_up_chip
pick_up_chips
pick_up_drink
pick_up_from_chips_packet
pick_up_spoon
pick_up_spoon
pick_up_wand
pick_up_wand
pig
pink
pink_gd
place
place_go_to
place_left
plan
plan2
play
please
please_yourself_ex
plenty
plug
point
point_left_down
point_point
poison
pond
poor_you
poor_you
post_office
pound
power
powerpoint
presentation
pretend
print
problem
product
proof
protect
proud
proudnew
provide
purple
put_here
put_on_left
put_on_letter
q
quả_bí
quả_bơ
quả_cam
quả_chanh
quả_chôm_chôm
quả_chuối
quả_cóc
quả_hồng
quả_hồng_xiêm
quả_mơ
quả_nhãn
quả_ổi
quả_ớt
quả_sầu_riêng
quả_táo
quả_thị
quả_vải
quả_vú_sữa
quả_xoài
quần
quận
quần_âu
quần_bò
quần_dài
quần_đùi
quan_hệ
quần_jean
quần_ngắn
quần_tây
quan_trọng
quàng
quắp
quarter_past
quarter_to
quạt
quạt_trần
quê_hương
quê_hương
quê_quán
que_tính
quên
questionaire
quét
qui_định
quick
quốc_ca
quốc_gia
quốc_hội
quốc_khánh
quốc_kỳ
quy_định
quyến_luyến
quyển_sách
quyển_vở
quyết_chiến
quyết_tâm
quyết_thắng
r
ra
rabbit
rác
rạch
răng
rào_chắn
rập_rờn
rat
rau
rau_bắp_cải
rau_cải
rau_mồng_tơi
rau_muống
rau_ngót
rẽ_sóng
rẽ_trái
read
ready
real
receive
reception
receptive
recognise
recommend
red
regions
regular
relate
rèm
remember
remind
repeat
reply
research
resident
responsibility
responsibility2
responsible
rest_arms_pause
resting_position
rhino
riêng
right_finger_point_right
right_place_go
right_stand_goes_to_left_place
right_stand_goes_to_left_point
right_stand_object
rình
river
rock
rồi
rộng
room
rope
rope_bridge
rót
roughly
rửa_bát
rửa_mặt
rude
rude2
rừng
ruột
s
s_clare_gd
sách
sad
safe
sai
sâm
sấm
same
sân
sân_bay
sẵn_có
sàn_nhà
sân_phơi
sẵn_sàng
sân_thượng
sân_trường
sản_xuất
sandpit
sáng
sang_đường
sáng_kiến
sáo
sau
sau_đại_học
sau_đó_
saw
say
scary
school
scotland
screen
scribble
sẽ_
second
see
send
send_all
send_me
separate
services
sét
seven
seven_hundred
seven_o_clock
seventeen
she
sheep
shoot
shop
shot
should
shoulder
show
show_me
show_nb
show_nb
shy
sick
siêu_thị
sign
sign_passion
sign_produce_
sign2
signtalk
silver
since
sinh_tố
sinh_viên
sister
sit_down_present
sit_two
sit_with_me
six
six_hundred
six_o_clock
sixteen
sky
slash
sleep
slide
slug
small
smell
snake
snake_long
snake_long
snow
snowflakes
snowflakes_bright_
snowflakes_glittering
snowflakes_sparkling
số
sổ_đầu_bài
sổ_điểm
sợ_hải
sổ_liên_lạc
sổ_mũi
sock
soft
solve
sớm
someone
someone2
sơn
sóng
sông
sống
sống
sông_bé
sông_lớn
sorry
sốt
south
space_rocket
sparkling
special
spelling
spider
spoon
spray
square
stairs
stand_up
start
statue
stature
stick
stick_small
still
story
story_small
strange
stubborn
stupid_dutch_sign
su_hào
sữa
sữa_chua
sức_khỏe
suit
sun
sun_bright__
sun_round
sunday
sưng
súng_đạn
suốu
surprise
suy_nghĩ
swallow
sweets
swings
swop
system
t
tác_nước
tai
tai_nạn
tại_sao
take
take_all_in
take_ball
talk
talkabout
tắm
tăng
tầng
tăng_cường
tạo_hóa
tập_thể
tập_thể_dục
tất
tắt
tất_cả_là
tàu_hỏa
tàu_thủy
tàu_vũ_trụ
tay
tây
tea
tear_out
technical
technology
teeth
teletext
tell
tem_thư
temple
temple_house
ten
tên
ten_no.2
ten_o_clock
terrible
test
testantony
tha_thứ
thác
thạch
thải_ra
thăm
tham_quan
thắm_thiết
thản
thận
thân_ái
than_đá
thân_thương
tháng
thẳng
tháng_1
tháng_10
tháng_11
tháng_12
tháng_2
tháng_3
tháng_4
tháng_5
tháng_6
tháng_7
tháng_8
tháng_9
thắng_cảnh
thắng_lợi
thành_phố
thành_tích
thank_you
thảo_luận
thấp
that
thật_thà
thầy_giáo
thế_nào
theatre
theirs
them
thềm_nhà
thép
there_
there_
they
they_two
thi_đua
thi_đua
thị_trấn
thích
thím
things
think
third
thirteen
this
thịt
thiu_thiu
thợ_cắt_tóc
thổ_lộ
thợ_may
thở_ra
thợ_xây
thoải_mái
thoai_thoải
thời_gian
thời_tiết
thơm_mức
thông_báo
thông_dịch_viên
thông_minh
thông_tin
three
three_hundred
three_o_clock
through
throw
thử
thứ_2
thứ_3
thứ_4
thứ_5
thứ_6
thứ_7
thứ_ba
thủ_đô
thứ_mấy
thu_nhận
thứ_nhât
thứ_nhì
thư_viện
thừa
thuận_tiện
thức
thức_ăn
thực_hành
thức_uống
thuê
thumb
thumb_up
thùng_rác
thuốc
thuốc_bắc
thước_kẻ
thuốc_nam
thuốc_tây
thương
thưởng
thương_mại
thường_xuyên
thursday
thuyền_buồm
tích_cực
tiêm
tiền
tiến_bộ
tiếp_nhận
tiếp_theo
tiết_kiệm
til
tim
tím
tìm_hiểu
time
time_ex
tỉnh
tình_bạn
tình_cảm
tính_chia
tính_cộng
tình_đồng_bào
tinh_khiết
tính_nhân
tính_trừ
tivi
to
tổ_dân_phố
to_find
toàn_bộ
today
together
tôi
tối
told
tôm
tổng_hợp
took
tooth
tốt
tốt_nhất
tower
tower_tall
toys
trả
trả_lời
trả_lời_câu_hỏi
trả_thù
trách_nhiệm
traditional
trái_cây
train
trạm_xe_buýt
trạm_y_tế
trần_nhà
trắng
tránh
tranh_giành
travel
trầy_xước
trẻ_em
treasure
trên
trên_tất_cả
triệu
trò_chơi
trơn
trong
trống
trong_bao_lâu
trồng_cây
trông_nom
trụ_sở
trục
trung_bình
trung_cấp
trung_hậu
trùng_hợp
trung_kiên
trước
trường_học
trường_mầm_non
trường_phổ_thông
trường_tiểu_học
trường_trung_học
truy_cập
truyền_thông
try
tủ
tự_hào
tủ_lạnh
tự_lập
tự_nhiên
tủ_sách
tự_tin
tư_vấn
tự_vệ
tuần
tube
tức_giận
tuesday
tuổi
tươi_tốt
tường
turn_left
tuyên_ngôn_độc_lập
twelve_clock
twenty
two
two_age
two_hundred
two_o_clock
tỷ
type
u
ủ
ư
u_ám
u_clare
u_clare
ủi
under_safe
understand
unicorn
unicorn_
uốn_khúc
uống
up
up_to_date
us
use
út
uyên_bác
v
và
va_chạm
vai
vai_trò
vấn_đề
văn_hóa
văn_hóa
văn_nghệ
văn_phòng
vàng
vâng_lời
vàng_óng
vào_lò
vào_lớp
various
vất_vả
váy
vé_xe
vee
vegetarian
very_very_difficult
vì
vĩ_đại
ví_dụ
vị_trí
vỉa_hè
video
viêm_não
viên_phấn
viếng_thăm
việt_nam
virtual
visit
vó
vỏ
vợ
vô_cơ
với
volunteer
vòng_tròn
vui
vui_lòng
vườn
vườn_hoa
vượt_lên
w
wait
waiting
wales
walk_across
walk_across_bridge
walk_round
walking
walking_alone
wall
wand
want
wave_length
way_
we
we2_
wear
wee_wee
welcome
well
west
wet
what
what_symm
when
where
where_ex
which
which-down
white
who
why
wide
will
will_go_right_to_left
wipe_-_off
wise
with
witt
wizard_hat
wolf
wood
woods
word
wordlist
work
worry
write
write_down_
write_send
wrong
wrong_me
wrong_you
x
xa
xà_beng
xã_hội
xà_lan
xám
xám_xịt
xanh
xanh_dương
xanh_lá
xanh_mượt
xạo
xấu
xấu_hổ
xây
xây_dựng
xây_dựng
xe_buýt
xe_cộ
xe_cứu_thương
xe_đạp
xe_máy
xe_tăng
xe_taxi
xe_xíchlo
xem_xét
xếp_hàng
xích_đu
xin
xin_đường
xin_lỗi
xin_phép
xôi
xóm
xù_xì
xuôi_ngược
xương
xương_sống
xương_sườn
xuống_xe
y
ý_kiến
y_tá
yeah/yes
yellow
yes/yeah_ex
yêu
yếu
yêu_nước
yêu_nước
you
you_all
you_fill_in_wipe-off
you_keep
young
yours
yours_on_left
yourself
yourselves
youth
z
zero
mét
atgt
xe_buýt
bến_xe
biển_báo
biện_pháp
bưu_điện
cách_mạng
cần_thơ
cao
chạy
chỉ
chính_sách
chú_ý
chức_năng
có_thể
có
dẫn_đầu
dân_tộc
đầu_tiên
đầu
dây_điện
đen
đèn
đến
địa_điểm
điện_thoại
điện
đoàn_kết
đồng_tháp
du_lịch
đường
gia_đình
giải_trí
giao_thông
giàu_có
giúp_đỡ
giờ
hồ_nước
hoạt_động
học_sinh
hôm_nay
kết_quả
khách_du_lịch
khi
khme
kiểm_tra
kinh
lại
lắp_ráp
lễ
lên_xuống
lên
mặt
mục_đích
nghỉ_hè
nghỉ
người_dân_tộc
phà_xe
nhân_dân
pước_mắt
pước
phá
phát_triển
phục_vụ
phường
quan_trọng
quốc_tế
sạch
tập_thể
tắt
thể_dục
tốt_nghiệp
tốt
trung_quốc
tuần
vấn_đề
vay
vẽ
vòng_xoay
xây
yêu_cầu
khách
hồ_chí_minh
hướng_dẫn
chợ_bến_thành
di_chuyển
_
thể_dục_thể_thao
tuyến
chuyến
điều_hành
tp.hcm
bến_thành
xây_dựng
vui_chơi
vận_tải
ngưng
và
hoa
bến_xe
vốn
quan_tâm
hỗ_trợ
đại_đoàn_kết
người_dân
dân_tộc_thiểu_số
nâng_cao
dân_trí
xong
hoàn_thành
hạng_mục
lắp_đặt
tháo_dỡ
thu_nhỏ
vòng
trăm
điểm
tết
0
1
2
3
4
6
7
8
9
10
100
quản_lý
tập_trung
chủ_yếu
người
hộ
đồng
mươi
phẩy
nâng
